---
kind: method
id: M:Autodesk.Revit.DB.WorksetPreview.Dispose
source: html/75c9e598-0e0e-f666-a6a5-2cbc266d8be9.htm
---
# Autodesk.Revit.DB.WorksetPreview.Dispose Method

Releases all resources used by the WorksetPreview

## Syntax (C#)
```csharp
public void Dispose()
```